tutorials/flowOverSphere/flowOverSphere/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform ( 1 0 0 );
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type slip;
    }

    bottom
    {
        type slip;
    }

    back
    {
        type slip;
    }

    front
    {
        type slip;
    }
}


// ************************************************************************* //
